#ifndef can_bms_h
#define can_bms_h

#include <can_smart.h>



String AlarmArrayCan[28] = {"Cell High", "Cell High 2", "Cell Low", "Cell Low 2", "Sum High", "Sum High 2", "Sum Low", "Sum Low 2",
                         "Charge Temp High", "Charge Temp High", "Charge Temp Low", "Charge Temp Low", "Disc. Temp High", "Disc. Temp High",
                         "Disc. Temp Low", "Disc. Temp Low",
                         "Charge Over Curr.", "Charge Over Curr.", "Disch. Over Curr.", "Disch. Over Curr.", "SOC High", "SOC High", "SOC Low", "SOC Low",
                         "Diffence Voltage", "Diffence Voltage", "Diffence Temp.", "Diffence Temp."
                        };

String firmversion_can;

struct Bms_can {

  uint32_t rated_volt_can;                      //0x50
  uint32_t rated_cap_can;

  uint8_t boardnum_can;
  uint8_t board1cellnum_can;             //0X51
  uint8_t board2cellnum_can;
  uint8_t board1tempnum_can;

  uint8_t cumilative_charge_can;
  uint8_t cumilative_discharge_can;             //0X52


  uint8_t boardtypebm_can;
  uint8_t activebm_can;                         // 0x53
  uint8_t boardyear_can;
  uint8_t boardmonth_can;
  uint8_t boardday_can;
  uint16_t secondsleepbm_can;


  String Firmwarevers_can;                       //0x54
  
 
						
	uint8_t AlarmStatus_can=99;
    String AlarmStatus_can_String="No Alarm";


  uint16_t cell_volthigh1_can;                   //0x59
  uint16_t cell_volthigh2_can;
  uint16_t cell_voltlow1_can;
  uint16_t cell_voltlow2_can;

  uint16_t short_current_can;                    //0x60
  uint16_t cur_sampling_res_can;

  uint8_t board_number_can;                       //0x60
  uint8_t slave_number_can;


  uint16_t sumv_high1_can;                    //0x5A
  uint16_t sumv_high2_can;
  uint16_t sumv_low1_can;
  uint16_t sumv_low2_can;

  uint16_t dischar_curr1_can;                    //0x5B
  uint16_t dischar_curr2_can;
  uint16_t charge_curr1_can;
  uint16_t charge_curr2_can;


  uint8_t charge_temp_high1_can;
  uint8_t charge_temp_high2_can;             //0X5C
  int charge_temp_low1_can;
  int charge_temp_low2_can;
  uint8_t discharge_temp_high1_can;
  uint8_t discharge_temp_high2_can;
  int discharge_temp_low1_can;
  int discharge_temp_low2_can;


  uint16_t SOC_high1_can;
  uint16_t SOC_high2_can;                   //0X5D
  uint16_t SOC_low1_can;
  uint16_t SOC_low2_can;


  uint16_t volt_diff1_can;
  uint16_t volt_diff2_can;                   //0X5E
  uint8_t temp_diff1_can;
  uint8_t temp_diff2_can;


  uint16_t balance_volt_can;
  uint16_t balance_volt_diff_can;                   //0X5F




  uint16_t sum_voltage_can;
  uint16_t gather_voltage_can;                   //0X90
  uint16_t current_can;
  uint16_t SOC_can;

  uint16_t max_cell_volt_can;
  uint8_t max_cell_volt_number_can;             //0X91
  uint16_t min_cell_volt_can;
  uint8_t min_cell_volt_number_can;

  uint8_t max_cell_temp_can;
  uint8_t max_cell_temp_number_can;             //0X92
  uint8_t min_cell_temp_can;
  uint8_t min_cell_temp_number_can;

  uint8_t state_can;                                           //0 stationary 1 cahrge 2 discharge
  uint8_t charge_can;
  uint8_t discharge_can;                       //0X93
  uint8_t bms_life_can;                                      // 0-255 cycles
  uint32_t rem_cap_can;                                      //remain capacity mAH


  uint8_t bat_str_can;                                      //battery string
  uint8_t bat_temp_can;                       //0X94        //temperature number
  uint8_t charg_sts_can;                                    //charge status
  uint8_t load_sts_can;                                     //load status

  uint16_t cell_voltage_can[24];                 //0x95         //cell voltage array

  uint8_t cell_temperature_can[14];                 //0x96       //cell temperature array

  uint8_t cell_balance_can[24];                 //0x97       //cell balance  0 closed   1 open

  uint8_t error_can[48];                 //0x98       //No error 0  error 1

};
struct Bms_can BMS_can;

uint8_t senddata[]={0x50,0xE4,0x70,0x25,0x42,0x00,0x00,0x00};

uint8_t datacanrec[8];

float encap_volt = 0;
float encap_current = 0;
uint8_t encap_soc = 0;


void BMS_recieve(uint8_t id,uint8_t device_id)
{
	uint32_t slaveid=0x18000040;
  uint32_t recid=0x18004000;
  uint8_t checksm = 0;
  int a = 0;
  uint16_t shift = 0;
	uint32_t rem1=0;
	uint32_t rem2=0;
	uint32_t rem3=0;
	uint32_t rem4=0;
 int art=1;

slaveid=(((id<<16)+(device_id<<8))|slaveid);  
recid=(((id<<16)+(device_id))|recid); 
  
//Serial.println(slaveid,HEX);
//Serial.println(recid,HEX);
  switch (id)
  {
				
		

    case 0x50:                    //rated cap rated volt
      can_send(senddata ,slaveid,8);
		  		 delay(1); 		 
	for(int ab=0;ab<10;ab++)
		{
		
		  can_recieve(datacanrec,recid);
				if(receive_id==recid)
			{
				break;
			}

		}
